IDEA Open Model
ConcreteULSCheckResultDiagramCapacityEc2 Class
Compatible with IDEA StatiCa 20.1
 ULS Check Diagram Capacity Ec2
Inheritance Hierarchy
System.Object
 IdeaRS.OpenModel.Concrete.CheckResult.ConcreteCheckResultBase
 IdeaRS.OpenModel.Concrete.CheckResult.ConcreteULSCheckResultDiagramCapacity
 IdeaRS.OpenModel.Concrete.CheckResult.ConcreteULSCheckResultDiagramCapacityEc2
 Namespace: IdeaRS.OpenModel.Concrete.CheckResult
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.1.0
Syntax
public class ConcreteULSCheckResultDiagramCapacityEc2 : ConcreteULSCheckResultDiagramCapacity
Public Class ConcreteULSCheckResultDiagramCapacityEc2
	Inherits ConcreteULSCheckResultDiagramCapacity
The ConcreteULSCheckResultDiagramCapacityEc2 type exposes the following members.
Constructors
Name | Description
ConcreteULSCheckResultDiagramCapacityEc2
Initializes a new instance of the ConcreteULSCheckResultDiagramCapacityEc2 class
Top
Properties
Name | Description
Fu
 calculated ultimate internal forces
 (Inherited from ConcreteULSCheckResultDiagramCapacity.)
Fu1
 calculated ultimate internal forces
 (Inherited from ConcreteULSCheckResultDiagramCapacity.)
Fu2
 calculated ultimate internal forces
 (Inherited from ConcreteULSCheckResultDiagramCapacity.)
Check
 settings of check type
 (Inherited from ConcreteCheckResultBase.)
CheckMethod
 method of check
 (Inherited from ConcreteULSCheckResultDiagramCapacity.)
CheckValue
 calculated limited value, calculated as strain to limit strain
 (Inherited from ConcreteCheckResultBase.)
InternalFores
 internal forces used for calculation
 (Inherited from ConcreteCheckResultBase.)
LimitCheckValue
 limit check value for result check
 (Inherited from ConcreteCheckResultBase.)
NonConformities
 Returns nonconformity in section
 (Inherited from ConcreteCheckResultBase.)
Result
 check result passed/failed
 (Inherited from ConcreteCheckResultBase.)
Top
See Also
Reference
IdeaRS.OpenModel.Concrete.CheckResult Namespace